In [2]:
import pandas as pd
import numpy as np

In [ ]:
X = pd.read_table('http://bit.ly/chiporders')

In [ ]:
X.head()

In [ ]:
pd.read_table('http://bit.ly/movieusers', sep = '|').head()

In [3]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [4]:
type(ufo)

pandas.core.frame.DataFrame

In [5]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [6]:
ufo.sample(n= 6, )

                 City Colors Reported Shape Reported State             Time
5099   Perkiomenville           GREEN           DISK    PA  7/24/1984 22:00
4697      Great Falls             NaN         CIRCLE    MT   6/1/1982 21:00
448            Graham             NaN         SPHERE    TX   9/1/1957 16:00
8274         Commerce             NaN         CIRCLE    TX   6/20/1995 9:30
2610        Jonesboro             NaN           DISK    GA  5/20/1974 20:30
16961      Silverdale             NaN       FIREBALL    WA  7/17/2000 20:50

In [8]:
ufo['location'] = ufo.City  +  ',' + ufo.State

In [9]:
ufo.sample(2)

,City,Colors Reported,Shape Reported,State,Time,location
4177,Rockford,NaN,DISK,IL,9/1/1979 0:05,"Rockford,IL"
2000,Tyre,NaN,OTHER,NY,7/15/1970 21:30,"Tyre,NY"

In [10]:
movies = pd.read_csv('http://bit.ly/imdbratings')

In [11]:
movies.sample(5)

,star_rating,title,content_rating,genre,duration,actors_list
609,7.7,Frost/Nixon,R,Drama,122,"[u'Frank Langella', u'Michael Sheen', u'Kevin ..."
402,7.9,Once,R,Drama,85,"[u'Glen Hansard', u'Mark\xe9ta Irglov\xe1', u'..."
530,7.8,Atonement,R,Drama,123,"[u'Keira Knightley', u'James McAvoy', u'Brenda..."
379,8.0,Edward Scissorhands,PG-13,Drama,105,"[u'Johnny Depp', u'Winona Ryder', u'Dianne Wie..."
937,7.4,Labyrinth,PG,Adventure,101,"[u'David Bowie', u'Jennifer Connelly', u'Toby ..."

In [13]:
movies.describe(include = 'all')

,star_rating,title,content_rating,genre,duration,actors_list
count,979.000000,979,976,979,979.000000,979
unique,NaN,975,12,16,NaN,969
top,NaN,The Girl with the Dragon Tattoo,R,Drama,NaN,"[u'Daniel Radcliffe', u'Emma Watson', u'Rupert..."
freq,NaN,2,460,278,NaN,6
mean,7.889785,NaN,NaN,NaN,120.979571,NaN
std,0.336069,NaN,NaN,NaN,26.218010,NaN
min,7.400000,NaN,NaN,NaN,64.000000,NaN
25%,7.600000,NaN,NaN,NaN,102.000000,NaN
50%,7.800000,NaN,NaN,NaN,117.000000,NaN
75%,8.100000,NaN,NaN,NaN,134.000000,NaN
max,9.300000,NaN,NaN,NaN,242.000000,NaN

In [14]:
movies.shape

(979, 6)

In [15]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [16]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [21]:
movies.sort_values('duration', inplace = True)

In [22]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
389,8.0,Freaks,UNRATED,Drama,64,"[u'Wallace Ford', u'Leila Hyams', u'Olga Bacla..."
338,8.0,Battleship Potemkin,UNRATED,History,66,"[u'Aleksandr Antonov', u'Vladimir Barsky', u'G..."
258,8.1,The Cabinet of Dr. Caligari,UNRATED,Crime,67,"[u'Werner Krauss', u'Conrad Veidt', u'Friedric..."
293,8.1,Duck Soup,PASSED,Comedy,68,"[u'Groucho Marx', u'Harpo Marx', u'Chico Marx']"
88,8.4,The Kid,NOT RATED,Comedy,68,"[u'Charles Chaplin', u'Edna Purviance', u'Jack..."

In [24]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [25]:
drinks.sample(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
125,Niue,188,200,7,7.0,Oceania
92,Laos,62,0,123,6.2,Asia
80,Iraq,9,3,0,0.2,Asia
154,Singapore,60,12,11,1.5,Asia
101,Malawi,8,11,1,1.5,Africa

In [26]:
from __future__ import print_function, division

import math
import numpy as np
from scipy.special import gamma

from thinkbayes2 import Pmf, Suite

ImportError: No module named thinkbayes2